# GuideGridSpacingParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..GuideGridSpacingParam Property
ParameterTypeId Class See Also
---
"Guide Spacing"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GuideGridSpacingParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GuideGridSpacingParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GuideGridSpacingParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace